{
  "admissions_process": "Admissions to Bennett University are based on entrance exams such as JEE Main / BU Entrance Test / SAT, followed by counseling and document verification. Candidates apply online through the official admissions portal.",
  "admissions_last_date": "The typical last date to apply for undergraduate admissions is around June; please check the official website for the exact current deadline.",
  "btech_eligibility": "For B.Tech at Bennett University, candidates generally need to have completed 10+2 with Physics and Mathematics as compulsory subjects along with one of Chemistry/Computer Science/Informatic Practices, and must have a valid score in JEE Main, SAT or BU Entrance Test.",
  "btech_fees": "The approximate tuition fee for B.Tech at Bennett University is in the range of 3.5–4.5 lakhs per year, depending on the program and batch. Hostel and other charges are additional.",
  "hostel_info": "Bennett University provides on-campus hostel facilities for both boys and girls with options like AC rooms, Wi-Fi, laundry, mess, common rooms and 24x7 security.",
  "hostel_fees": "Hostel fees at Bennett University depend on room type (AC/Non-AC, single/double/triple sharing) and are usually charged annually in addition to tuition fees.",
  "scholarships": "Bennett University offers merit-based scholarships based on entrance exam scores and academic performance. Specific scholarship slabs are usually based on JEE Main percentile or equivalent scores.",
  "placements_overview": "Bennett University has a dedicated Career Services team that conducts placement drives, internships and industry interactions. Many reputed companies visit campus for recruitment every year.",
  "average_package": "The average package for B.Tech students at Bennett University varies by batch and branch, but is generally in a competitive range for private universities.",
  "highest_package": "The highest package offered at Bennett University varies each year and may include both domestic and international offers. For the latest exact figure, refer to the official placement report.",
  "campus_location": "Bennett University is located in Greater Noida, Uttar Pradesh, near Knowledge Park II, with good connectivity from Delhi and Noida.",
  "transport": "Students typically reach Bennett University via personal transport, cabs or metro plus last-mile connectivity. The nearest metro stations are usually in Noida, from where cabs or buses can be taken to campus.",
  "student_life": "Bennett University has an active campus life with multiple student clubs, technical societies, cultural events, hackathons and sports activities throughout the year.",
  "contact_admissions": "For admissions-related queries, students can contact the Bennett University admissions team via the official website contact form or the published admissions helpline numbers and email IDs.",
  "website": "You can visit the official Bennett University website at https://www.bennett.edu.in for the most accurate and updated information."
}
